# <center>Тема 1. Введение в Pandas</center>

In [56]:
import os
import numpy as np
import pandas as pd

### Работа с Series

In [2]:
apples = pd.Series([10, 30, 20, 25, 4, 0], 
                   index = ['Alise', 'Andrew', 'Bob', 'Matt', 'Charles', 'Ann']) 
apples

Alise      10
Andrew     30
Bob        20
Matt       25
Charles     4
Ann         0
dtype: int64

In [3]:
apples.max()

30

In [4]:
apples.Andrew

30

In [ ]:
pd.NA, None, np.nan

In [63]:
apples['Carl'] = np.nan
apples

Alise      10.0
Andrew     30.0
Bob        20.0
Matt       25.0
Charles     4.0
Ann         0.0
Carl        NaN
dtype: float64

In [64]:
apples.median()

15.0

In [67]:
apples = apples.fillna(apples.median())
apples

Alise      10.0
Andrew     30.0
Bob        20.0
Matt       25.0
Charles     4.0
Ann         0.0
Carl       15.0
dtype: float64

In [65]:
apples.fillna(apples.median(), inplace=True)
apples

Alise      10.0
Andrew     30.0
Bob        20.0
Matt       25.0
Charles     4.0
Ann         0.0
Carl       15.0
dtype: float64

In [7]:
apples.astype('Int64')

Alise      10
Andrew     30
Bob        20
Matt       25
Charles     4
Ann         0
Carl       15
dtype: Int64

In [8]:
apples[1]

30.0

In [72]:
apples[:3]

Alise     10.0
Andrew    30.0
Bob       20.0
dtype: float64

In [10]:
apples[apples > 15]

Andrew    30.0
Bob       20.0
Matt      25.0
dtype: float64

In [75]:
apples[(apples > 15) & (apples < 30)]

Bob     20.0
Matt    25.0
dtype: float64

In [76]:
len(apples[apples > 15])

3

In [77]:
apples.shape

(7,)

### Работа с DataFrame

In [13]:
df1 = pd.DataFrame(np.random.randn(5, 3), 
                   index=['o1', 'o2', 'o3', 'o4', 'o5'], 
                   columns=['f1', 'f2', 'f3'])
df1

          f1        f2        f3
o1 -0.843831  1.113141 -0.446643
o2  1.138881 -0.211050 -0.782051
o3  1.317487  0.045477  0.478017
o4  0.409710  0.225443  0.740720
o5 -1.463742  0.922036  0.466889

In [79]:
df2 = pd.DataFrame({'A': np.random.random(5), 
                    'B': ['a', 'b', 'c', 'd', 'e'], 
                    'C': np.arange(5) > 2})
df2

          A  B      C
0  0.166369  a  False
1  0.341048  b  False
2  0.417045  c  False
3  0.141696  d   True
4  0.511086  e   True

In [15]:
df2.loc[3, 'B']

'd'

In [86]:
df2.loc[:, :]

          A  B      C
0  0.166369  a  False
1  0.341048  b  False
2  0.417045  c  False
3  0.141696  d   True
4  0.511086  e   True

In [17]:
df2.at[2, 'B'] = 'F'
df2

          A  B      C
0  0.482171  a  False
1  0.490756  b  False
2  0.551184  F  False
3  0.419774  d   True
4  0.471224  e   True

In [18]:
df2.loc[[3, 4], 'B'] = 'Q'
df2

          A  B      C
0  0.482171  a  False
1  0.490756  b  False
2  0.551184  F  False
3  0.419774  Q   True
4  0.471224  Q   True

In [99]:
df2[['B', 'C']] = 4
df2

          A  B  C
0  0.166369  4  4
1  0.341048  4  4
2  0.417045  4  4
3  0.141696  4  4
4  0.511086  4  4

In [102]:
df2.loc[df2.A > 0.3, 'B'] = 3
df2

          A  B  C
0  0.166369  4  4
1  0.341048  3  4
2  0.417045  3  4
3  0.141696  3  4
4  0.511086  3  4

In [19]:
df2.loc[5] = 3.1415
df2

          A       B       C
0  0.482171       a  0.0000
1  0.490756       b  0.0000
2  0.551184       F  0.0000
3  0.419774       Q  1.0000
4  0.471224       Q  1.0000
5  3.141500  3.1415  3.1415

In [20]:
df2.iloc[2, 0] = 14.31
df2

           A       B       C
0   0.482171       a  0.0000
1   0.490756       b  0.0000
2  14.310000       F  0.0000
3   0.419774       Q  1.0000
4   0.471224       Q  1.0000
5   3.141500  3.1415  3.1415

In [105]:
df2 = df2.rename({'B': 'BBBBB', 'C': 'CCCCC'}, axis=1)
df2

          A  BBBBB  CCCCC
0  0.166369      4      4
1  0.341048      3      4
2  0.417045      3      4
3  0.141696      3      4
4  0.511086      3      4

In [107]:
df2.columns = ['AAAAA', 'B', 'C']
df2

      AAAAA  B  C
0  0.166369  4  4
1  0.341048  3  4
2  0.417045  3  4
3  0.141696  3  4
4  0.511086  3  4

In [108]:
df1.columns = ['A', 'B', 'C']
df3 = df1.append(df2, sort=False)
df3

           A         B         C     AAAAA
o1 -0.843831  1.113141 -0.446643       NaN
o2       NaN -0.211050 -0.782051       NaN
o3  1.317487  0.045477  0.478017       NaN
o4  0.409710  0.225443       NaN       NaN
o5 -1.463742  0.922036  0.466889       NaN
0        NaN  4.000000  4.000000  0.166369
1        NaN  3.000000  4.000000  0.341048
2        NaN  3.000000  4.000000  0.417045
3        NaN  3.000000  4.000000  0.141696
4        NaN  3.000000  4.000000  0.511086

In [24]:
df1.at['o2', 'A'] = np.nan
df1.at['o4', 'C'] = np.nan
df1

           A         B         C
o1 -0.843831  1.113141 -0.446643
o2       NaN -0.211050 -0.782051
o3  1.317487  0.045477  0.478017
o4  0.409710  0.225443       NaN
o5 -1.463742  0.922036  0.466889

In [25]:
pd.isnull(df1)

        A      B      C
o1  False  False  False
o2   True  False  False
o3  False  False  False
o4  False  False   True
o5  False  False  False

In [114]:
df1.dropna(how='any')

           A         B         C
o1 -0.843831  1.113141 -0.446643
o3  1.317487  0.045477  0.478017
o5 -1.463742  0.922036  0.466889

In [115]:
df1.fillna(df1.median())

           A         B         C
o1 -0.843831  1.113141 -0.446643
o2 -0.217061 -0.211050 -0.782051
o3  1.317487  0.045477  0.478017
o4  0.409710  0.225443  0.010123
o5 -1.463742  0.922036  0.466889

## Примеры анализа

In [161]:
for df in pd.read_csv('nba.csv', chunksize=10):
    print(df[['Date', 'Visitor/Neutral']].head(1).to_string())

                Date      Visitor/Neutral
0  Tue, Oct 27, 2015  Cleveland Cavaliers
                 Date    Visitor/Neutral
10  Wed, Oct 28, 2015  San Antonio Spurs
                 Date Visitor/Neutral
20  Fri, Oct 30, 2015      Miami Heat
                 Date     Visitor/Neutral
30  Fri, Oct 30, 2015  Los Angeles Lakers

In [117]:
filename = 'nba.csv'

if not os.path.exists(filename):
    tables = pd.read_html("http://www.basketball-reference.com/leagues/NBA_2016_games.html")
    games = tables[0]
    games.to_csv(filename)
else:
    games = pd.read_csv(filename)
games.head()

,Unnamed: 0,Date,Start (ET),Visitor/Neutral,PTS,Home/Neutral,PTS.1,Unnamed: 6,Unnamed: 7,Attend.,Notes
0,0,"Tue, Oct 27, 2015",8:00p,Cleveland Cavaliers,95,Chicago Bulls,97,Box Score,NaN,21957,NaN
1,1,"Tue, Oct 27, 2015",8:00p,Detroit Pistons,106,Atlanta Hawks,94,Box Score,NaN,19187,NaN
2,2,"Tue, Oct 27, 2015",10:30p,New Orleans Pelicans,95,Golden State Warriors,111,Box Score,NaN,19596,NaN
3,3,"Wed, Oct 28, 2015",7:00p,Washington Wizards,88,Orlando Magic,87,Box Score,NaN,18846,NaN
4,4,"Wed, Oct 28, 2015",7:30p,Philadelphia 76ers,95,Boston Celtics,112,Box Score,NaN,18624,NaN

In [118]:
column_names = {'Date': 'date', 'Start (ET)': 'start',
                'Unamed: 2': 'box', 'Visitor/Neutral': 'away_team', 
                'PTS': 'away_points', 'Home/Neutral': 'home_team',
                'PTS.1': 'home_points', 'Unamed: 7': 'n_ot'}

games = games.rename(columns=column_names)
games.head()

,Unnamed: 0,date,start,away_team,away_points,home_team,home_points,Unnamed: 6,Unnamed: 7,Attend.,Notes
0,0,"Tue, Oct 27, 2015",8:00p,Cleveland Cavaliers,95,Chicago Bulls,97,Box Score,NaN,21957,NaN
1,1,"Tue, Oct 27, 2015",8:00p,Detroit Pistons,106,Atlanta Hawks,94,Box Score,NaN,19187,NaN
2,2,"Tue, Oct 27, 2015",10:30p,New Orleans Pelicans,95,Golden State Warriors,111,Box Score,NaN,19596,NaN
3,3,"Wed, Oct 28, 2015",7:00p,Washington Wizards,88,Orlando Magic,87,Box Score,NaN,18846,NaN
4,4,"Wed, Oct 28, 2015",7:30p,Philadelphia 76ers,95,Boston Celtics,112,Box Score,NaN,18624,NaN

In [122]:
games = games.dropna(thresh=4)[['date', 'away_team', 'away_points', 'home_team', 'home_points', 'Attend.']]
games.head(9)

,date,away_team,away_points,home_team,home_points,Attend.
0,"Tue, Oct 27, 2015",Cleveland Cavaliers,95,Chicago Bulls,97,21957
1,"Tue, Oct 27, 2015",Detroit Pistons,106,Atlanta Hawks,94,19187
2,"Tue, Oct 27, 2015",New Orleans Pelicans,95,Golden State Warriors,111,19596
3,"Wed, Oct 28, 2015",Washington Wizards,88,Orlando Magic,87,18846
4,"Wed, Oct 28, 2015",Philadelphia 76ers,95,Boston Celtics,112,18624
5,"Wed, Oct 28, 2015",Chicago Bulls,115,Brooklyn Nets,100,17732
6,"Wed, Oct 28, 2015",Utah Jazz,87,Detroit Pistons,92,18434
7,"Wed, Oct 28, 2015",Indiana Pacers,99,Toronto Raptors,106,19800
8,"Wed, Oct 28, 2015",Charlotte Hornets,94,Miami Heat,104,19724

In [125]:
games.date = pd.to_datetime(games['date'], format='%a, %b %d, %Y')
games.head()

,date,away_team,away_points,home_team,home_points,Attend.
0,2015-10-27,Cleveland Cavaliers,95,Chicago Bulls,97,21957
1,2015-10-27,Detroit Pistons,106,Atlanta Hawks,94,19187
2,2015-10-27,New Orleans Pelicans,95,Golden State Warriors,111,19596
3,2015-10-28,Washington Wizards,88,Orlando Magic,87,18846
4,2015-10-28,Philadelphia 76ers,95,Boston Celtics,112,18624

In [123]:
games.tail(3)

,date,away_team,away_points,home_team,home_points,Attend.
35,"Sat, Oct 31, 2015",Brooklyn Nets,91,Memphis Grizzlies,101,16013
36,"Sat, Oct 31, 2015",Phoenix Suns,101,Portland Trail Blazers,90,17906
37,"Sat, Oct 31, 2015",Sacramento Kings,109,Los Angeles Clippers,114,19060

In [131]:
print(games.shape)
print(games.columns.to_list())

(38, 6)
['date', 'away_team', 'away_points', 'home_team', 'home_points', 'Attend.']

In [126]:
len(games)

38

In [34]:
games.dtypes

date           datetime64[ns]
away_team              object
away_points             int64
home_team              object
home_points             int64
Attend.                 int64
dtype: object

In [132]:
games.head()

,date,away_team,away_points,home_team,home_points,Attend.
0,2015-10-27,Cleveland Cavaliers,95,Chicago Bulls,97,21957
1,2015-10-27,Detroit Pistons,106,Atlanta Hawks,94,19187
2,2015-10-27,New Orleans Pelicans,95,Golden State Warriors,111,19596
3,2015-10-28,Washington Wizards,88,Orlando Magic,87,18846
4,2015-10-28,Philadelphia 76ers,95,Boston Celtics,112,18624

In [35]:
games.describe()

       away_points  home_points       Attend.
count    38.000000    38.000000     38.000000
mean    103.657895   101.263158  18274.763158
std      13.187374    13.951042   1547.135163
min      75.000000    71.000000  13858.000000
25%      94.000000    94.250000  17678.000000
50%     103.000000   102.000000  18323.000000
75%     112.000000   110.750000  19155.250000
max     139.000000   136.000000  21957.000000

In [36]:
games.describe(include=['object', 'datetime64[ns]'])

                       date  away_team             home_team
count                    38         38                    38
unique                    5         26                    26
top     2015-10-28 00:00:00  Utah Jazz  Los Angeles Clippers
freq                     14          3                     2
first   2015-10-27 00:00:00        NaN                   NaN
last    2015-10-31 00:00:00        NaN                   NaN

In [37]:
games.describe(percentiles=[0.1, 0.9, 0.9995])

        away_points  home_points       Attend.
count     38.000000    38.000000     38.000000
mean     103.657895   101.263158  18274.763158
std       13.187374    13.951042   1547.135163
min       75.000000    71.000000  13858.000000
10%       90.100000    82.900000  16639.100000
50%      103.000000   102.000000  18323.000000
90%      117.300000   113.300000  19803.600000
99.95%   138.907500   135.926000  21931.192500
max      139.000000   136.000000  21957.000000

In [38]:
games.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 38 entries, 0 to 37
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         38 non-null     datetime64[ns]
 1   away_team    38 non-null     object
 2   away_points  38 non-null     int64
 3   home_team    38 non-null     object
 4   home_points  38 non-null     int64
 5   Attend.      38 non-null     int64
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 2.1+ KB

In [39]:
games.sort_values(by='away_points', ascending=False).head()

,date,away_team,away_points,home_team,home_points,Attend.
22,2015-10-30,Oklahoma City Thunder,139,Orlando Magic,136,18846
34,2015-10-31,Golden State Warriors,134,New Orleans Pelicans,120,18406
9,2015-10-28,New York Knicks,122,Milwaukee Bucks,97,18717
26,2015-10-30,Washington Wizards,118,Milwaukee Bucks,113,13858
33,2015-10-31,New York Knicks,117,Washington Wizards,110,20356

In [40]:
games.sort_values(by=['away_points', 'home_points'], ascending=[True, False]).head()

,date,away_team,away_points,home_team,home_points,Attend.
27,2015-10-30,Brooklyn Nets,75,San Antonio Spurs,102,18418
6,2015-10-28,Utah Jazz,87,Detroit Pistons,92,18434
19,2015-10-29,Dallas Mavericks,88,Los Angeles Clippers,104,19218
3,2015-10-28,Washington Wizards,88,Orlando Magic,87,18846
35,2015-10-31,Brooklyn Nets,91,Memphis Grizzlies,101,16013

**Какой средний балл у команд, которые играли дома?**

In [41]:
games['home_points'].mean()

101.26315789473684

**Какой максимальный балл у команд, которые играли на выезде 28 октября 2015?**

In [42]:
games[games['date'] == '2015-10-28'].head()

,date,away_team,away_points,home_team,home_points,Attend.
3,2015-10-28,Washington Wizards,88,Orlando Magic,87,18846
4,2015-10-28,Philadelphia 76ers,95,Boston Celtics,112,18624
5,2015-10-28,Chicago Bulls,115,Brooklyn Nets,100,17732
6,2015-10-28,Utah Jazz,87,Detroit Pistons,92,18434
7,2015-10-28,Indiana Pacers,99,Toronto Raptors,106,19800

In [43]:
games.loc[games['date'] == '2015-10-28', 'away_points'].max()

122

In [138]:
games.loc[games['date'] == '2015-10-28', ['away_points', 'home_points']].max()

away_points    122
home_points    112
dtype: int64

In [162]:
122/112

1.0892857142857142

**Какой минимальный балл у команд, которые играли дома, 30 октября 2015 года, и на матчах которых было более 18500 зрителей?**

In [45]:
games.loc[(games['date'] == '2015-10-30') & (games['Attend.'] > 18500), 'home_points'].min()

102

In [142]:
games[['away_points', 'home_points', 'Attend.']].apply(lambda ser: np.mean(ser))

away_points      103.657895
home_points      101.263158
Attend.        18274.763158
dtype: float64

In [143]:
games.dtypes

date           datetime64[ns]
away_team              object
away_points             int64
home_team              object
home_points             int64
Attend.                 int64
dtype: object

In [47]:
col = games['away_team']
col.str.split().head()

0      [Cleveland, Cavaliers]
1          [Detroit, Pistons]
2    [New, Orleans, Pelicans]
3       [Washington, Wizards]
4       [Philadelphia, 76ers]
Name: away_team, dtype: object

In [150]:
games.groupby('date', as_index=False).agg({'home_points': 'mean', 'away_points': 'mean',
                                           'home_team': 'nunique', 'away_team': 'nunique'})

        date  home_points  away_points  home_team  away_team
0 2015-10-27   100.666667    98.666667          3          3
1 2015-10-28    99.500000   103.214286         14         14
2 2015-10-29   102.666667   104.000000          3          3
3 2015-10-30   102.833333   103.083333         12         12
4 2015-10-31   101.833333   108.166667          6          6

In [146]:
games[games['date'] == '2015-10-28']

,date,away_team,away_points,home_team,home_points,Attend.
3,2015-10-28,Washington Wizards,88,Orlando Magic,87,18846
4,2015-10-28,Philadelphia 76ers,95,Boston Celtics,112,18624
5,2015-10-28,Chicago Bulls,115,Brooklyn Nets,100,17732
6,2015-10-28,Utah Jazz,87,Detroit Pistons,92,18434
7,2015-10-28,Indiana Pacers,99,Toronto Raptors,106,19800
8,2015-10-28,Charlotte Hornets,94,Miami Heat,104,19724
9,2015-10-28,New York Knicks,122,Milwaukee Bucks,97,18717
10,2015-10-28,San Antonio Spurs,106,Oklahoma City Thunder,112,18203
11,2015-10-28,Cleveland Cavaliers,106,Memphis Grizzlies,76,18119
12,2015-10-28,Denver Nuggets,105,Houston Rockets,85,18240
13,2015-10-28,Dallas Mavericks,111,Phoenix Suns,95,18055
14,2015-10-28,New Orleans Pelicans,94,Portland Trail Blazers,112,19393
15,2015-10-28,Los Angeles Clippers,111,Sacramento Kings,104,17458
16,2015-10-28,Minnesota Timberwolves,112,Los Angeles Lakers,111,18997

In [153]:
g = games.groupby('date')
for dt, sub_df in g:
    print(dt)
    print(sub_df.head().to_string())
    break

2015-10-27 00:00:00
        date             away_team  away_points              home_team  home_points  Attend.
0 2015-10-27   Cleveland Cavaliers           95          Chicago Bulls           97    21957
1 2015-10-27       Detroit Pistons          106          Atlanta Hawks           94    19187
2 2015-10-27  New Orleans Pelicans           95  Golden State Warriors          111    19596

In [50]:
d1 = g.get_group('2015-10-29')
d1

,date,away_team,away_points,home_team,home_points,Attend.
17,2015-10-29,Memphis Grizzlies,112,Indiana Pacers,103,18165
18,2015-10-29,Atlanta Hawks,112,New York Knicks,101,19812
19,2015-10-29,Dallas Mavericks,88,Los Angeles Clippers,104,19218

In [157]:
games['date'].value_counts(sort=False)

2015-10-27     3
2015-10-28    14
2015-10-29     3
2015-10-30    12
2015-10-31     6
Name: date, dtype: int64

In [52]:
games[['home_points', 'away_points', 'Attend.']].corr()

             home_points  away_points   Attend.
home_points     1.000000     0.416534  0.191471
away_points     0.416534     1.000000 -0.065669
Attend.         0.191471    -0.065669  1.000000

In [53]:
games[['home_points', 'away_points', 'Attend.']].cov()

             home_points  away_points       Attend.
home_points   194.631579    76.633001  4.132740e+03
away_points    76.633001   173.906828 -1.339813e+03
Attend.      4132.739687 -1339.812945  2.393627e+06

In [54]:
games['away_remainder'] = games['away_points'] % 5
games['home_remainder'] = games['home_points'] % 5
pd.crosstab(games['date'], games['away_remainder'])

away_remainder  0  1  2  3  4
date
2015-10-27      2  1  0  0  0
2015-10-28      3  4  3  1  3
2015-10-29      0  0  2  1  0
2015-10-30      2  0  3  2  5
2015-10-31      0  2  2  0  2

In [55]:
games.pivot_table(values='Attend.', index=['away_remainder', 'home_remainder'])

                                    Attend.
away_remainder home_remainder
0              0               17986.000000
               1               19596.000000
               2               19666.333333
               3               17660.000000
1              0               17980.500000
               1               17066.000000
               2               18203.000000
               4               18322.500000
2              0               19205.500000
               1               17740.333333
               2               18963.750000
               3               18165.000000
3              2               18846.000000
               3               15378.000000
               4               19218.000000
4              0               18406.000000
               1               18589.333333
               2               17936.000000
               3               16035.000000
               4               19392.000000

## Классное задание

Ссылка форму: https://forms.gle/QMc6wbzKkKWYySeR8

QR код для формы

![](qr-classwork1.png)

In [158]:
!jupyter notebook

Collecting package metadata (current_repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /Users/an.loskutov/Documents/anaconda3

  added / updated specs:
    - jupyter


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2020.7.22  |                0         124 KB
    conda-4.8.5                |           py37_0         2.9 MB
    jupyter-1.0.0              |           py37_7           6 KB
    openssl-1.1.1h             |       haf1e3a3_0         2.2 MB
    ------------------------------------------------------------
                                           Total:         5.2 MB

The following packages will be UPDATED:

  ca-certificates                               2020.6.24-0 --> 2020.7.22-0
  conda                                        4.8.4-py37_0 --> 4.8.5-py37_0
  jupyter            conda-forge/noarch::jupyter-1.0.0-py_2 --> pkgs/main/osx-64::jupyter-1.0.0-py37_7
  openssl                                 1.1.1g-h1de35cc_0 --> 1.1.1h-haf1e3a3_0


Proceed ([y]/n)? ^C

CondaSystemExit:
Operation aborted.  Exiting.